/* ******************************************************************** */
/* WATCOM C/C++ 10.5 DLL ENTRY POINT                                    */
/* ******************************************************************** */
#define INCL_ESC_NO_NETWORK
#define INCL_ESC_NO_WARP4
#include <LUCIER.H>
#include "MMIOPROC.H"

int __dll_initialize();
int __dll_terminate(void);
void APIENTRY __dll_cleanup(ULONG ulRes);

/* ******************************************************************** */
/* DLL初期化時に自動的に呼ばれる関数                                    */
/* エラー時は 0 を戻すと、DLLは起動されない。                           */
/* ******************************************************************** */
int __dll_initialize(void)  {
   /* ***************************************************************** */
   /* 解放時登録関数の予約                                              */
   /* ***************************************************************** */
   #ifndef STACK_LINK
   DosExitList(0x0000FF00|EXLST_ADD,__dll_cleanup);
   #endif

return 1; }

/* ******************************************************************** */
/* DLL解放時に自動的に呼ばれる関数                                      */
/* ******************************************************************** */
int __dll_terminate(void)  {
   #ifndef STACK_LINK
   #endif
return 1; }

/* ******************************************************************** */
/* __dll_cleanup                                                        */
/* ******************************************************************** */
void APIENTRY __dll_cleanup(ULONG ulRes)  {
   DosExitList(0x0000FF00|EXLST_EXIT,__dll_cleanup);
return;  }

